package Service;

public class College implements Study{
    @Override
    public void degreeOfEducation() {
        System.out.println("Після закінчення училища ви отримаєте освітній рівень молодший бакалавр");
    }

    @Override
    public void scholarship() {// Розмір стипендії
        System.out.println("Стипендія становить 600 грн");
    }

    @Override
    public void educationInstitutions() {// перелік закладів
        System.out.println("Вище професійне училище Львівського державного університету безпеки життєдіяльності (м. Вінниця)");
    }

    @Override
    public void showInfo() {// інформація про заклади
        System.out.println("Вище професійне училище Львівського державного університету безпеки життєдіяльності (м.Вінниця) – заклад третього (вищого) рівня професійної (професійно-технічної) освіти державної форми власності,\nякий здійснює підготовку за освітньо-кваліфікаційними рівнями “кваліфікований робітник”, ”молодший спеціаліст” , та освітньо-професійної програми \"Організація та техніка протипожежного захисту\" та освітньо-професійним ступенем \"фаховий молодший бакалавр\"");
    }
}
