package Service;

class Lyceum implements Study{

    @Override
    public void degreeOfEducation() {
        System.out.println("Після закінчення ліцею у вас буде повна загальна середня освіта");
    }

    @Override
    public void scholarship() {// розмір стипендії
        System.out.println("Для ліцеїстів виплата стипендії не передбачена");
    }

    @Override
    public void educationInstitutions() {// перелік закладів освіти
        System.out.println("Ліцей цивільного захисту Львівського державного університету безпеки життєдіяльності (м. Вінниця)");
    }

    @Override
    public void showInfo() {// інформація про заклади освіти
        System.out.println("23 травня 2012 року міністр МНС Віктор Балога підписав наказ про створення Ліцею цивільного захисту Вінницького вищого професійного училища Львівського державного університету безпеки життєдіяльності (нова назва ліцею- Ліцей цивільного захисту Львівського державного університету безпеки життєдіяльності (м.Вінниця)).\n" +
                "\n" +
                "Ліцей створено з метою забезпечення умов для здобуття повної загальної середньої освіти і забезпечення соціального захисту дітей-сиріт, дітей позбавлених батьківського піклування, дітей, батьки яких загинули при виконанні службових обов’язків, дітей працівників ДСНС та обдарованої молоді.");
    }
}